# 混淆矩陣

In Prolog, you can represent a **confusion matrix** as a structured fact or set of rules to store and retrieve classification results. A confusion matrix typically consists of True Positives (TP), True Negatives (TN), False Positives (FP), and False Negatives (FN).

### **Example: Confusion Matrix Representation in Prolog**
```prolog
% Define confusion matrix facts
confusion_matrix(tp, 50).  % True Positives
confusion_matrix(tn, 30).  % True Negatives
confusion_matrix(fp, 10).  % False Positives
confusion_matrix(fn, 5).   % False Negatives

% Retrieve confusion matrix values
get_confusion_matrix(TP, TN, FP, FN) :-
    confusion_matrix(tp, TP),
    confusion_matrix(tn, TN),
    confusion_matrix(fp, FP),
    confusion_matrix(fn, FN).

% Compute accuracy: (TP + TN) / (TP + TN + FP + FN)
accuracy(Acc) :-
    get_confusion_matrix(TP, TN, FP, FN),
    Total is TP + TN + FP + FN,
    Total > 0,  % Prevent division by zero
    Acc is (TP + TN) / Total.

% Compute precision: TP / (TP + FP)
precision(Prec) :-
    get_confusion_matrix(TP, _, FP, _),
    Sum is TP + FP,
    Sum > 0,
    Prec is TP / Sum.

% Compute recall: TP / (TP + FN)
recall(Rec) :-
    get_confusion_matrix(TP, _, _, FN),
    Sum is TP + FN,
    Sum > 0,
    Rec is TP / Sum.

% Compute F1-score: 2 * (Precision * Recall) / (Precision + Recall)
f1_score(F1) :-
    precision(Prec),
    recall(Rec),
    Sum is Prec + Rec,
    Sum > 0,
    F1 is 2 * (Prec * Rec) / Sum.

```

### **Usage Example**
You can query the confusion matrix and performance metrics in Prolog:

```prolog
?- get_confusion_matrix(TP, TN, FP, FN).
TP = 50, TN = 30, FP = 10, FN = 5.

?- accuracy(A).
A = 0.8888888888888888.

?- precision(P).
P = 0.8333333333333334.

?- recall(R).
R = 0.9090909090909091.

?- f1_score(F1).
F1 = 0.8695652173913044.
```

This Prolog program allows you to compute essential classification metrics using a confusion matrix. You can modify it to dynamically update values or calculate additional metrics.
